MingJie9/38KHz/STM32_KHT11/User/main.c
/*
 * @Author: ming 1209932698@qq.com
 * @Date: 2023-10-19 11:35:35
 * @LastEditors: ming 1209932698@qq.com
 * @LastEditTime: 2024-07-30 16:37:40
 * @FilePath: \4-1 OLED显示屏\User\main.c
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "DHT11.h"
#include "LED.h"






int main(void)
{
	// 定义变量
	uint8_t humidity=0;
	uint8_t temperature=0;
	LED_Init();
	SystemInit2();
  	GPIO_Config1();
	/*模块初始化*/
	OLED_Init();		//OLED初始化
	
	/*OLED显示*/
	OLED_ShowChar(1, 1, 'A');				//1行1列显示字符A
	
	OLED_ShowString(1, 3, "HelloWorld!");	//1行3列显示字符串HelloWorld!
	
	OLED_ShowNum(2, 1, 12345, 5);			//2行1列显示十进制数字12345，长度为5
	
	OLED_ShowSignedNum(2, 7, -66, 2);		//2行7列显示有符号十进制数字-66，长度为2
	
	OLED_ShowHexNum(3, 1, 0xAA55, 4);		//3行1列显示十六进制数字0xA5A5，长度为4
	
	OLED_ShowBinNum(4, 1, 0xAA55, 16);
	//4行1列显示二进制数字0xA5A5，长度为16
	//C语言无法直接写出二进制数字，故需要用十六进制表示
	//OLED_ShowString(5, 3, "HelloWorld!");
	//OLED_ShowString(5, 3, "HelloWorld!");

	
	while (1)
	{
		Delay_ms(1000);
		//一行一列
		OLED_ShowString(1, 1, "NBA");
		Delay_ms(1000);
		OLED_ShowString(1, 1, "ABCDEFGHYJKLMNOP");
		while (1) {
        if (DHT11_ReadData(&temperature, &humidity)) {
            // 成功读取数据
			OLED_ShowString(1, 2, "Tem:");
			OLED_ShowNum(1, 6,temperature , 2);

        } else {
			OLED_ShowString(1, 4, "DHT11 ERROR");
			OLED_ShowNum(3, 6,temperature , 3);
			OLED_ShowNum(3, 10,DHT11_ReadData(&temperature, &humidity), 1);		
            // 读取数据失败
        }
        Delay_ms(2000); // 每隔 2 秒读取一次数据
    }
	}
}
